#include <iostream>

int main()
{
    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //                                                                                                //
    // 1. Написать программу, проверяющую что сумма двух (введенных с клавиатуры)                     //
    // чисел лежит в пределах от 10 до 20 (включительно), если да – вывести строку "true",            //
    // в противном случае – "false";                                                                  //
    //                                                                                                //
    ////////////////////////////////////////////////////////////////////////////////////////////////////

    
    int n, x, summ;
    std::cout << "Please write two number: " << std::endl;
    std::cin >> n >> x;
    summ = n + x;

    if (summ >= 10 && summ <= 20)
    {
        std::cout << "\ntrue" << std::endl;
    }
    else {
        std::cout << "\nfalse" << std::endl;
    }   

    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //                                                                                                //
    // 2. Написать программу, выводящую на экран строку “true”, если две целочисленные константы,     //
    // объявленные в её начале либо обе равны десяти сами по себе, либо их сумма равна десяти.        //
    // Иначе "false".                                                                                 //
    //                                                                                                //
    ////////////////////////////////////////////////////////////////////////////////////////////////////

    const int A{10}, B{10};

    if ( (A == 10 && B == 10) || ((A + B) == 10) )
    {
        std::cout << "\ntrue" << std::endl;
    }
    else {
        std::cout << "\nfalse" << std::endl;
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //                                                                                                //
    // 3. Написать программу которая выводит на экран список всех нечетных чисел он 1 до 50.          //
    //  Например: "Your numbers: 1 3 5 7 9 11 13 …". Для решения используйте любой С++ цикл.          //
    //                                                                                                //
    ////////////////////////////////////////////////////////////////////////////////////////////////////

    const int SIZE = 51;

    int arr[SIZE] = { 0 };
    
    for (std::size_t i = 0; i < SIZE; i++) {        
        arr[i] = i;
    }

    for (std::size_t i : arr) {
        if (i % 2 == 0) {
            continue;
        }
        else {
            std::cout << arr[i] << " ";
        }        
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //                                                                                                //
    // 4. Со звёздочкой. Написать программу, проверяющую, является ли некоторое число - простым.      //
    // Простое число — это целое положительное число, которое делится без остатка                     //
    //  только на единицу и себя само.                                                                //
    //                                                                                                //
    ////////////////////////////////////////////////////////////////////////////////////////////////////
    
    int prime_num[SIZE]{0};

    for (size_t k = 2; k * k < SIZE; k++) {
        for (size_t i = k * k; i < SIZE; i += k)
        {
            prime_num[i] = 1;
        }        
    }
    for (int i = 2; i < SIZE; i++) {
        if (prime_num[i] == 0)
        std::cout << " " << arr[i];
    }
       

    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //                                                                                                //
    // 5. Со звёздочкой. Пользователь вводит с клавиатуры число (год) : от 1 до 3000.                 //
    // Написать программу, которая определяет является ли этот год високосным.                        //
    // Каждый 4 - й год является високосным, кроме каждого 100 - го,                                  // 
    // при этом каждый 400 - й –високосный.Вывести результаты работы программы в консоль.             //
    // Замечание : Можно сделать в одном проекте(например разместить разные задания в разных функциях)./
    // Или в разных проектах если это кажется удобнее.                                                //
    //                                                                                                //
    ////////////////////////////////////////////////////////////////////////////////////////////////////

    int year;
    std::cout << "\nPlease write year: " << std::endl;
    std::cin >> year;

    if (year % 4 == 0) {
        if (year % 400 == 0) {
            std::cout << " leap year " << std::endl;
        }
        else if (year % 100 == 0)
        {
            std::cout << "don`t leap year " << std::endl;
        }
        else
        {
            std::cout << " leap year "  << std::endl;
        }
    }
    else 
    {
        std::cout << "don`t leap year " << std::endl;
    }
    

    
    
}